app/Controllers/Board.php

    public function list(): string
    {
        /*
        // 쿼리빌더 예시
        $data['lists'] = $this->boardModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `board`
ORDER BY `id` DESC

    public function save()
    {
        /*
        // 쿼리빌더 예시
        $data = [
            'user' => 'hanhee'
          , 'title' => $this->request->getVar('title')
          , 'content' => $this->request->getVar('content')
          , 'date' => date("Y-m-d")
        ];
        $this->boardModel->save($data);
---
INSERT INTO `board` (`content`) VALUES ('22')